Indicates if a filter is applied to the view.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  Since:  2014
 Syntax
  C#
public bool IsFilterApplied(
	ElementId filterElementId
)
  Visual Basic
Public Function IsFilterApplied ( _
	filterElementId As ElementId _
) As Boolean
  Visual C++
public:
bool IsFilterApplied(
	ElementId^ filterElementId
)
 Parameters
  filterElementId
 Type:  Autodesk.Revit.DB ElementId
 ElementId of the filter.
 Return Value
 True if the filter is applied to the view, false otherwise.
 Exceptions
  Exception  |   Condition
   Autodesk.Revit.Exceptions ArgumentException   |   ElementId is not associated with a FilterElement.
   Autodesk.Revit.Exceptions ArgumentNullException   |   A non-optional argument was NULL
   Autodesk.Revit.Exceptions InvalidOperationException   |   View does not belong to a project document. -or- The view type does not support Visibility/Graphics Overriddes.
 See Also
  View Class
  Autodesk.Revit.DB Namespace